{
  "productDisplay": "Product Display",
  "Product": "Products",
  "aboutUs": "About Us",
  "contactUs": "Contact Us",
  "brandName": "Ignis Terra AI Solution",
  "tagline": "The Art of Human-Machine Collaboration",
  "description": "No learning curve, only growth curve. Make AI your team's superpower.",
  "keywords": "AI Solutions,Artificial Intelligence,Enterprise AI,AI Tools,AI Optimization,Business Intelligence,Smart Office",
  "heroTitle": "Intelligent Experience in One Second",
  "heroSubtitle": "No learning needed, ready to use out of the box, making AI your team's superpower",
  "bookConsultation": "Book a Free Consultation",
  "exploreSolutions": "Explore Solutions",
  "companySlogan": "Warm Intelligence, Ignited for Reality",
  
  "commonPainPoints": "Common Enterprise Pain Points",
  "painPointsDescription": "Regardless of industry, businesses face similar management and decision-making challenges",
  
  "swipeToViewMore": "← Swipe left or right to view more cards →",
  "scrollToPrevious": "Scroll to previous page",
  "scrollToNext": "Scroll to next page",
  
  "beyondTools": "Beyond Tools, Redefining Human-Machine Collaboration",
  "solutionDescription": "puts people first, making AI an extension of your team's intelligence, integrating into workflows to create real value",
  
  "intelligentPartner": "Intelligent Partner",
  "intelligentPartnerDesc": "Not just a cold tool, but an intelligent partner that understands your industry language and business logic - ready to use with zero barriers",
  
  "dataInsight": "Data Perspective",
  "dataInsightDesc": "Based on logical analysis rather than emotional reactions, helping you make more balanced decisions",
  
  "riskOpportunity": "Risk & Opportunity Identification",
  "riskOpportunityDesc": "Not just passively responding to commands, but monitoring business dynamics to provide early warnings and opportunity insights",
  
  "noPersonnelConflicts": "Zero Personnel Conflicts",
  "noPersonnelConflictsDesc": "Eliminate office politics, interpersonal conflicts, and emotional management issues - team collaboration purely focused on achieving goals",
  
  "maximumScaleEffect": "Maximum Scale Effect",
  "maximumScaleEffectDesc": "As business expands, marginal costs approach zero, creating true economies of scale",
  
  "barrierFreeGlobalization": "Barrier-Free Globalization",
  "barrierFreeGlobalizationDesc": "Use multiple languages simultaneously, eliminating communication barriers in international business for truly global operations",
  
  "bookDemo": "Book a Demo to Learn More",
  
  "fourProductLines": "Four Product Lines: Collaborative Full-Scenario Solutions",
  "productLinesDescription": "Ignis Terra AI Solution's four product lines form a complete intelligent ecosystem, covering internal enterprise, consumer decision-making, life planning, and cultural domains to achieve full-scenario intelligent collaboration",
  
  "corporateAI": "Corporate AI Genesis",
  "prismBuyAI": "Prism Buy AI",
  "blazeCipher": "BlazeCipher",
  "prismTravel": "Prism Travel | AI Travel Solution",
  
  "positioning": "Positioning:",
  "coreValue": "Core Value:",
  "targetScenario": "Target Scenario:",
  "features": "Features:",
  
  "corporateAIPosition": "Digital think tank and collaboration partner for enterprises",
  "corporateAIValue": "Systematic knowledge transfer, objective decision support",
  "corporateAITarget": "Internal enterprise collaboration and decision support",
  "corporateAIFeatures": "Starting from a single AI entity, expandable to multi-role collaboration",
  
  "prismBuyPosition": "Intelligent shopping guide solution",
  "prismBuyValue": "Shopping experience integrating aesthetics and data",
  "prismBuyTarget": "Consumer decision support and experience enhancement",
  "prismBuyFeatures": "Multi-dimensional product comparison and personalized recommendations",
  
  "blazeCipherPosition": "AI-powered modern destiny solution",
  "blazeCipherValue": "Fusion of traditional wisdom and modern technology",
  "blazeCipherTarget": "Life key decision assistance",
  "blazeCipherFeatures": "Breaking the binary opposition between superstition and science",
  
  "prismTravelPosition": "Personal exclusive travel planner",
  "prismTravelValue": "Fingerprint-like unique travel experiences",
  "prismTravelTarget": "Travel planning and experience optimization",
  "prismTravelFeatures": "Creating personalized journeys based on interests and preferences",
  
  "learnMore": "View",
  "solution": "Solution",
  
  "intelligentExperienceTitle": "Intelligent Experience at Your Fingertips",
  "intelligentExperienceDesc": "Ignis Terra AI Solution platform integrates multiple functionalities for a seamless human-machine collaboration experience",
  
  "technicalHighlights": "Technical Highlights",
  "intuitiveInteraction": "Intuitive Interaction Experience",
  "intuitiveInteractionDesc": "Carefully designed zero-learning-curve interface, experience value immediately upon use",
  "multimodalInfoProcessing": "Multimodal Information Processing",
  "multimodalInfoProcessingDesc": "Supports analysis of business data in multiple forms including text and images",
  "knowledgeSystem": "Knowledge Precipitation System",
  "knowledgeSystemDesc": "Transform scattered business knowledge into structured intelligent assets",
  "valueOrientedImplementation": "Value-Oriented Implementation",
  "valueOrientedImplementationDesc": "Following the 'quick small steps, value first' deployment philosophy",
  
  "quickSmallSteps": "Quick Small Steps, Value First",
  "explorationPhase": "Exploration Phase",
  "explorationPhaseDesc": "Evaluate data and systems to define success metrics, laying the foundation for intelligent transformation",
  "launchPhase": "Launch Phase",
  "launchPhaseDesc": "Deploy and demonstrate initial value, letting the team experience the efficiency gains brought by intelligent collaboration",
  "growthPhase": "Growth Phase",
  "growthPhaseDesc": "Expand AI capabilities to more business areas, forming a comprehensive intelligent ecosystem",
  
  "reasonableInvestment": "Reasonable Investment, Continuous Returns",
  "lowThresholdStart": "Low Threshold Start",
  "lowThresholdStartDesc": "Start with a single AI entity, no need for large upfront investment",
  "scaleAsNeeded": "Scale as Needed",
  "scaleAsNeededDesc": "Add features or roles according to actual needs",
  "continuousValueOptimization": "Continuous Value Optimization",
  "continuousValueOptimizationDesc": "AI systems continuously learn and evolve with use",
  "longTermPartnership": "Long-Term Partnership",
  "longTermPartnershipDesc": "Not a one-time sale, but continuous value creation",
  "arrangeDemo": "Arrange a Demo to Learn More",
  
  "greetingFounder": "A Greeting from the Founder",
  "founderSubtitle": "Using technology to enhance human potential, creating more value and meaning",
  "dearVisitor": "Dear visitor:",
  "founderIntro1": "I am Kelly Liu, founder of Ignis Terra AI Solution. Thank you for visiting our website.",
  "founderIntro2": "As a professional with 20 years of multinational business experience, I have been pondering a question: \"How can technology truly serve people, rather than replace human value?\" This question led me to establish Ignis Terra AI Solution.",
  "founderIntro3": "My career spans global business centers including Beijing, Tokyo, Berlin, London, Singapore, and Taiwan, and I am proficient in Chinese, English, and Japanese. These experiences have given me a unique cross-cultural perspective, allowing me to deeply understand that companies with different cultural backgrounds face similar challenges but need tailored solutions.",
  "founderIntro4": "At Ignis Terra, my team and I are committed to transforming abstract AI concepts into practical business tools. We don't just talk about technology; we focus on solving practical problems. I firmly believe that the best technology should have warmth, understand human nature, and touch people's hearts.",
  "founderIntro5": "My vision is simple: to create AI solutions that are both warm and grounded in reality, helping companies maintain flexibility and competitiveness in this unpredictable era. AI should not be a cold tool, but an intelligent partner that understands your business.",
  "founderIntro6": "I look forward to the opportunity to learn more about your business needs and explore the infinite possibilities of AI collaboration together.",
  "sincerely": "Sincerely,",
  "founderQuote1": "The most dazzling code, if it doesn't solve real problems, is just digital fireworks.",
  "founderQuote2": "Technology must have warmth, understand human nature, and touch people's hearts—Warm Intelligence, Ignited for Reality.",
  
  "diverseGlobalVision": "Diverse Global Vision",
  "diverseGlobalVisionDesc": "Proficient in Chinese, English, and Japanese, with living and working experience in six major global business hubs, deeply understanding business needs across different cultures",
  "fromConceptToRealization": "From Concept to Realization",
  "fromConceptToRealizationDesc": "Transform abstract concepts into practical solutions, quickly turning innovative ideas into testable prototypes",
  "intelligenceWithWarmth": "Intelligence with Warmth",
  "intelligenceWithWarmthDesc": "Create AI solutions that are both warm and grounded in reality, helping businesses deal with the unpredictable business environment",
  
  "readyForChange": "Ready for Change?",
  "contactUsSubtitle": "Contact us to explore how Ignis Terra AI Solution can help your business achieve true human-machine collaboration",
  "freeConsultation": "Book a Free Consultation",
  "freeConsultationDesc": "Fill out the form, and our experts will contact you within 24 hours to provide a customized AI solution for your business",
  "name": "Name",
  "email": "Email",
  "companyName": "Company Name",
  "yourNeeds": "Your Needs",
  "submit": "Submit",

  "companyName": "Ignis Terra AI Solution",
  "viewSolution": "View Solution",
  "solutionIcon": "Sol",
  "solutionTitle": "Ignis Solution",

  "painPoint1Title": "Trust Crisis, Burden Alone",
  "painPoint1Description": "At midnight, Director Wang frowns at financial reports, afraid to discuss with anyone. 'Can I trust the CFO's interpretation? His cousin just works for a competitor...' Business is like a battlefield, loneliness is the norm, with no truly trustworthy advisors.",
  "painPoint1Solution": "CEO Think Tank AI Assistant, always on your side. Late-night decisions are no longer lonely, the system is based on pure data analysis, unaffected by interpersonal relationships, no need to worry about 'can I say this?' Let you lead decisions with more confidence, without exposing vulnerability.",
  "painPoint1Icon": "Tr",
  
  "painPoint2Title": "Surface Prosperity, Undercurrents Surging",
  "painPoint2Description": "'Financial reports look good, but cash flow is urgent,' the CFO reports hesitantly. Managers are often deceived by surface numbers, and by the time they discover the truth, it's too late. The boss is exhausted from dealing with sudden 'accidents,' always in firefighting mode.",
  "painPoint2Solution": "Enterprise Health Radar System insights beneath the surface. Not only analyzes visible data, but also focuses on hidden indicators and trend signals. Provides warnings before crises form, responding calmly rather than frantically firefighting.",
  "painPoint2Icon": "Wa",
  
  "painPoint3Title": "Paying Idle People, Efficiency Hard to Measure",
  "painPoint3Description": "'I always feel that some departments have redundant staff,' Director Zhang observes, 'but when directly asking subordinates, the answer is always \"not enough manpower\".' Real workload cannot be assessed, company expenses continue to inflate, while ROI continues to decline.",
  "painPoint3Solution": "Work Efficiency Analysis System provides objective basis. Tracks actual work output to input ratio, identifies efficiency bottlenecks and redundant links. Lets the boss finally see clearly 'who is working hard, who is just going through the motions,' resource allocation no longer relies on guesswork.",
  "painPoint3Icon": "Ef",
  
  "painPoint4Title": "Knowledge Loss, Unable to Inherit",
  "painPoint4Description": "'Engineer Li is about to retire, his experience is irreplaceable...' the person in charge worries. Once an employee with thirty years of experience leaves, they take away not just skills, but invaluable tacit knowledge. The company's core competitiveness is lost as personnel flow.",
  "painPoint4Solution": "AI Knowledge Inheritance System digitally preserves the thinking patterns, judgment standards, and tacit knowledge of key experts. Important experiences are no longer buried in individual brains, but transformed into permanent intellectual assets for the enterprise.",
  "painPoint4Icon": "Kn",
  
  "painPoint5Title": "Information Explosion, Decision Paralysis",
  "painPoint5Description": "'Should we invest in this project?' The meeting room falls silent, with dozens of analysis reports piled on the table that no one can fully digest. The more data, the more difficult decisions become. Analysis reports are just piles of documents that cannot be transformed into action guidelines.",
  "painPoint5Solution": "Multi-dimensional Decision Analysis Engine transforms massive data into clear insights. Like GPS, it doesn't just provide maps, but gives navigation. Integrates various perspectives, presents key decision points, making complex problems clear and actionable.",
  "painPoint5Icon": "In",
  
  "painPoint6Title": "Communication Breakdown, Efficiency Collapse",
  "painPoint6Description": "'I've already said it three times!' Department heads operate independently, and the same problems repeatedly occur. Serious information silos within the enterprise, important information is drowned in endless emails, meetings, and documents, unable to be found and utilized when needed.",
  "painPoint6Solution": "Intelligent Collaboration Hub breaks down departmental barriers. Automatically records, classifies, and associates all communication content, ensuring key information is never lost and can be retrieved at any time. Enables team collaboration to function as efficiently as a single brain.",
  "painPoint6Icon": "Co",
  
  "painPoint7Title": "Board Questioning, Indefensible",
  "painPoint7Description": "'The board always asks questions we haven't prepared for,' the CFO says nervously. The senior team is exhausted from dealing with sudden inquiries, the boss repeatedly becomes passive in front of investors, and trust gradually erodes.",
  "painPoint7Solution": "Comprehensive Preparation System simulates potential board questions. Based on market trends, financial report data, and competitor dynamics, it predicts sensitive questions and prepares powerful responses. Keeps the boss always composed and in control during key meetings.",
  "painPoint7Icon": "Bo",
  
  "painPoint8Title": "Employees with Hidden Agendas, Preparing in Advance",
  "painPoint8Description": "'Why are competitors always one step ahead of us?' Corporate secrets constantly leak, key talent leaves at the worst times, and core customers mysteriously churn. The boss is exhausted but cannot find the root of the problem.",
  "painPoint8Solution": "Risk Early Warning Intelligence System detects abnormal patterns. Sudden changes in data access frequency and customer interaction patterns are warning signals. The system doesn't monitor personal privacy but can early detect abnormal behavior patterns that may harm the enterprise, letting you prepare before the storm.",
  "painPoint8Icon": "Ri",
  
  "painPoint9Title": "Too Many Choices, Decision Paralysis",
  "painPoint9Description": "Ms. Wang, preparing her wedding outfit, searches for 'spring wedding attire' on her phone and is instantly overwhelmed by tens of thousands of results. From formal to casual, Chinese to Western styles, prices from thousands to hundreds of thousands, she scrolls for an hour with sore eyes but cannot decide - too many choices...",
  "painPoint9Solution": "Ms. Wang tells Prism: 'I'm attending a friend's wedding and need spring attire.' After asking for details, the system immediately presents three options perfectly matching her body shape, budget, and occasion. No longer anxious about infinite options, she happily makes a decision within ten minutes.",
  "painPoint9Icon": "Ch",
  
  "painPoint10Title": "Management Rights Delegated, Supervision Difficult",
  "painPoint10Description": "'There are too many branch companies, I cannot personally supervise each one,' the group chairman expresses helplessly. After business expansion, direct control is diluted, middle managers act independently, and group strategies are difficult to implement consistently.",
  "painPoint10Solution": "Global Management AI Assistant provides 'virtual avatar' capabilities. The boss doesn't need to be on site to grasp key indicators and abnormal situations at each branch. Intelligently filters truly important issues, allowing management coverage to expand without sacrificing depth.",
  "painPoint10Icon": "Ma",
  
  "painPoint11Title": "Shopping Experiences All the Same",
  "painPoint11Description": "Ms. Zhang browses baby products on major e-commerce platforms, but the system always recommends the best-selling or most profitable items, far from her actual needs and parenting philosophy. A series of 'Recommended for You' feels like talking to a wall, with no personalization whatsoever.",
  "painPoint11Solution": "Ms. Zhang tells Prism she prefers natural materials and wants to adopt the Montessori educational method. The system immediately understands and recommends product combinations that match these unique preferences, even explaining how each item supports her parenting philosophy. She sighs: 'Finally someone who truly understands my needs.'",
  "painPoint11Icon": "Sh",
  
  "painPoint12Title": "Transformation Barrier, Hesitating to Move Forward",
  "painPoint12Description": "Small and medium business owners look at AI implementation costs that easily reach millions and sigh: 'This is a game for big companies, we can't afford to play.' The digital divide grows wider and wider.",
  "painPoint12Solution": "Quick small steps, value first. Starting with a single AI entity, low-threshold subscription model, cheaper than hiring a senior manager, affordable for every company. Expand after proving value, reducing transformation risks and pressure.",
  "painPoint12Icon": "Tr",
  
  "chatWelcomeMessage": "Hi! I'm Ignis Mind 👋\n\nWant to talk about AI? Looking for business solutions? Or just curious about what I can do?\n\nI'm not just a chatbot — I'm an intelligent partner designed to truly understand your business needs. Why not tell me about the challenges you're facing, and we can find solutions together?\n\n(Each conversation makes my spark brighter! Looking forward to igniting business wisdom with you.)\n\nAwaiting your reply! ✨",
  "chatDefaultResponse": "Thank you for your message! I've received your question and am thinking about how best to assist you. As your business intelligence partner, I'm always ready to find the best solutions for your business challenges.",
  "chatErrorMessage": "Sorry, I'm temporarily unable to connect. My spark seems to need reigniting. Please try again later, I'm looking forward to providing intelligent support for your business!",
  "chatClose": "Close chat",
  "chatOpen": "Open chat",
  "chatAssistantStatus": "Ready to assist you anytime",
  "chatMinimize": "Minimize chat",
  "chatInputPlaceholder": "Enter your question...",
  "chatInputLabel": "Chat input field",
  "chatSendButton": "Send message",
  "chatFooterText": "Ignis Mind — Your Intelligent Business Partner by Ignis Terra AI Solution"
} 